Конфигурация/Documents/ТБС_ЗаявкиIT.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>ТБС_ЗаявкиIT</Name>
			<Comment>Заявки IT</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТБС_БаллыСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Comment>Важность</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТБС_Важность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполненияЗаявки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дивизион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТБС_Дивизионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапланироватьНаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТБС_ИсточникиЗаявокIT</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассовыйИнцидент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Система</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТБС_СистемыIT</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТБС_КатегорииIT</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТБС_СтатусыЗаявкиIT</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрудоемкостьРабЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаВыполненияЗаявки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапланироватьНаДату</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентВыполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Решение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТрудоемкостьРабЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапРабот</Name>
							<Comment>Этап работ</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ТБС_ЭтапыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/ТБС_СтатусыЗаявкиIT.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>ТБС_СтатусыЗаявкиIT</Name>
			<Comment>Статусы заявок IT</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
					<Comment>Новая заявка IT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначенИсполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запланирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тестирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВариантыМаршрутизацииЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>ВариантыМаршрутизацииЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Последовательно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Параллельно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Смешанно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/РолиПредметов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>РолиПредметов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Основной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вспомогательный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заполняемый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ТБС_ЗаявкиIT/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаПриоритетныхДанных");
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;

	Для Каждого мСтрока Из Исполнители Цикл
		Если НЕ ЗначениеЗаполнено(мСтрока.Исполнитель) Тогда
			Отказ = Истина;
			ТекстСообщения = "ru = 'в табличной части не указан исполнитель'";
			СообщитьПользователю(ТекстСообщения,"Исполнитель",Отказ);
		КонецЕсли;
		
		Если Статус = Перечисления.ТБС_СтатусыЗаявкиIT.Новая 
			И ЗначениеЗаполнено(мСтрока.Исполнитель) Тогда
			Статус = Перечисления.ТБС_СтатусыЗаявкиIT.НазначенИсполнитель;
		КонецЕсли; 
	КонецЦикла; 
	
	Если Не Отказ Тогда
		Если Исполнители.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект,Исполнители[0]);
		КонецЕсли; 
	КонецЕсли; 
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого мСтрока Из Исполнители Цикл
		 СформироватьБизнесПроцесс(мСтрока.Исполнитель);
	КонецЦикла;                    
	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КонтактнаяИнформацияПользователя(Пользователь) Экспорт 
	
	    Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	Справочник.Пользователи.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &Пользователь
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПользователя)";
		Запрос.УстановитьПараметр("Пользователь",Пользователь);
		РезультатЗапроса = Запрос.Выполнить();
		
		Представление = "";
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Представление = Выборка.Представление;
		КонецЦикла; 
		
		Возврат Представление;
		
КонецФункции

Функция СообщитьПользователю(Текст,Параметр,Отказ)
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр(Текст),
	Строка(Ответственный));
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	ТекстСообщения,
	ЭтотОбъект,
	Параметр,,
	Отказ);
	
КонецФункции

#КонецОбласти

#Область БизнесПроцесс
Функция СформироватьБизнесПроцесс(Исполнитель)
	
	мБизнесПроцессСуществует = БизнесПроцессСуществует(Исполнитель);	
	
	Если Не мБизнесПроцессСуществует Тогда
		УстановитьПривилегированныйРежим(Истина);
		СтартоватьБизнесПроцессИсполнение(Исполнитель);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 
КонецФункции

Функция БизнесПроцессСуществует(Исполнитель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсполнениеПредметы.Ссылка
		|ИЗ
		|	БизнесПроцесс.Исполнение.Предметы КАК ИсполнениеПредметы
		|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.Исполнение.Исполнители КАК ИсполнениеИсполнители
		|		ПО ИсполнениеПредметы.Ссылка = ИсполнениеИсполнители.Ссылка
		|ГДЕ
		|	ИсполнениеПредметы.Предмет = &Предмет
		|	И ИсполнениеИсполнители.Исполнитель = &Исполнитель";
	
	Запрос.УстановитьПараметр("Предмет",     Ссылка);
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции

Функция СтартоватьБизнесПроцессИсполнение(Исполнитель)
	
	ИсполнениеОбъект          = БизнесПроцессы.Исполнение.СоздатьБизнесПроцесс();
	ИсполнениеОбъект.Автор    = Ссылка.Ответственный;
	ИсполнениеОбъект.Важность = Ссылка.Важность;
	ИсполнениеОбъект.ВариантИсполнения = Перечисления.ВариантыМаршрутизацииЗадач.Параллельно;
	ИсполнениеОбъект.Дата              = ТекущаяДата();
	ИсполнениеОбъект.ДатаНачала        = ИсполнениеОбъект.Дата;
	ИсполнениеОбъект.Контролер         = Ссылка.Ответственный;
	ИсполнениеОбъект.Наименование      = "Исполнить " +  Строка(Ссылка);
	ИсполнениеОбъект.Описание          = Ссылка.Описание;
	ИсполнениеОбъект.Проверяющий       = Ссылка.Ответственный;
	
	НовыйПредмет = ИсполнениеОбъект.Предметы.Добавить();
	НовыйПредмет.Предмет      = Ссылка;
	НовыйПредмет.ИмяПредмета  = Ссылка;
	НовыйПредмет.РольПредмета = Перечисления.РолиПредметов.Основной;
	НовыйПредмет.ИмяПредмета  =  МультипредметностьВызовСервера.ПолучитьСсылкуНаИмяПредметаПоСсылкеНаПредмет(
				Ссылка, ИсполнениеОбъект.Предметы.ВыгрузитьКолонку("ИмяПредмета"));
				
	ПредметыЗадач = ИсполнениеОбъект.ПредметыЗадач.Добавить();
	ПредметыЗадач.ИмяПредмета   = НовыйПредмет.ИмяПредмета;
	ПредметыЗадач.ТочкаМаршрута = БизнесПроцессы.Исполнение.ТочкиМаршрута.Исполнить;	
	
	НоваяСтрока = ИсполнениеОбъект.Исполнители.Добавить();
	НоваяСтрока.Исполнитель = Исполнитель;
	
	ИсполнениеОбъект.УдалитьПредмет = Ссылка;
	ИсполнениеОбъект.Записать();
	
	СтартПроцессовСервер.СтартоватьПроцесс(ИсполнениеОбъект);
	
	СтартоватьБизнесПроцессОзнакомление(Исполнитель);
	
КонецФункции

Функция СтартоватьБизнесПроцессОзнакомление(Исполнитель)
	
	ОзнакомлениеОбъект                   = БизнесПроцессы.Ознакомление.СоздатьБизнесПроцесс();
	ОзнакомлениеОбъект.Автор    		 = Исполнитель;
	ОзнакомлениеОбъект.Важность 		 = Ссылка.Важность;
	ОзнакомлениеОбъект.Дата              = ТекущаяДата();
	ОзнакомлениеОбъект.ДатаНачала        = ОзнакомлениеОбъект.Дата;
	ОзнакомлениеОбъект.Наименование      = "Ознакомиться, назначен исполнитель: " + Строка(Исполнитель) + " " +  Строка(Ссылка);
	ОзнакомлениеОбъект.Описание          = Ссылка.Описание;
	
	НовыйПредмет = ОзнакомлениеОбъект.Предметы.Добавить();
	НовыйПредмет.Предмет      = Ссылка;
	НовыйПредмет.ИмяПредмета  = Ссылка;
	НовыйПредмет.РольПредмета = Перечисления.РолиПредметов.Основной;
		
	НоваяСтрока = ОзнакомлениеОбъект.Исполнители.Добавить();
	НоваяСтрока.Исполнитель = Ссылка.Ответственный;
	
	ОзнакомлениеОбъект.Записать();
	
	СтартПроцессовСервер.СтартоватьПроцесс(ОзнакомлениеОбъект);
	
КонецФункции


#КонецОбласти
